Repository: 84000/data-translation-memory
Catalog: Toh_134-The_Absorption_That_Encapsulates_All_Merit-v2.tmx
Source language: bo
Languages: en

source: ལྟ་བར་གྱུར་པ་ཐམས་ཅད་སེལ་བ་དང་། ཤེས་རབ་བསྒྲུབ་པ་སྟེ་བྱ་བ་འདི་གཉིས་བྱེད་དོ། །
en: It eliminates any views and brings about insight.

source: རིགས་ཀྱི་བུ་སྦྱིན་པའི་ཚོགས་ནི་ཟག་པ་དང་བཅས་པ་དང་། ལེན་པ་དང་བཅས་པ་དང་། ཕུང་པོར་རྣམ་པར་སྨིན་པའོ། །
en: Son of noble family, the accumulation of generosity involves defilement and grasping, and ripens in the aggregates.

source: རིགས་ཀྱི་བུ་ཚུལ་ཁྲིམས་ཀྱི་ཚོགས་ནི་ཟག་པ་དང་བཅས་པ་དང་། ལེན་པ་དང་བཅས་པ་དང་། ཕུང་པོར་རྣམ་པར་སྨིན་པའོ། །
en: Son of noble family, the accumulation of discipline, too, involves defilement and grasping, and ripens in the aggregates.

source: རིགས་ཀྱི་བུ་ཐོས་པའི་ཚོགས་ནི་ཟག་པ་མེད་པ་དང་། ལེན་པ་མེད་པ་དང་། ཕུང་པོར་རྣམ་པར་སྨིན་པ་མ་ཡིན་པའོ། །
en: Son of noble family, the accumulation of learning is undefiled, devoid of grasping, and does not ripen in the aggregates.

source: རིགས་ཀྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྩོན་འགྲུས་བརྩམས་པ་རྣམས་ཀྱིས་ཐོས་པའི་ཚོགས་ལ་བརྩོན་པར་བྱའོ། །
en: Therefore, son of noble family, those bodhisattva great beings who strive to be diligent should exert themselves in the accumulation of learning.”

source: སྦྱིན་པའི་ཚོགས་དང་ཚུལ་ཁྲིམས་ཀྱི་ཚོགས་དང་ཐོས་པའི་ཚོགས་འདི་དག་བསྟན་པ་ན་སྔོན་དགེ་བའི་རྩ་བ་བསྐྱེད་པའི་སྲོག་ཆགས་སུམ་སྟོང་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །
en: On the occasion of this teaching on the accumulations of generosity, discipline, and learning, three thousand beings who had previously engendered roots of virtue formed the resolve set on unsurpassed and completely perfect awakening.

source: ལྷའི་བུ་ལྔ་སྟོང་ནི་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྡུལ་མེད་ཅིང་དྲི་མ་དང་བྲལ་བ་རྣམ་པར་དག་གོ། །
en: Five thousand gods purified their Dharma eyes regarding phenomena so that they became cleared of dust, and immaculate.

source: ཚན་པོ་ཆེ་ཆེན་པོ་དྲི་མ་མེད་པའི་གཟི་བརྗིད་ཀྱིས་ཀྱང་རྗེས་སུ་འཐུན་པའི་ཆོས་ཀྱི་བཟོད་པ་ཐོབ་བོ། །
en: The mighty strongman Vimalatejā, too, achieved acceptance of the Dharma accordingly.

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་དུ་དང་ལྡན་ན་མི་སྐྱེ་བའི་ཆོས་རྣམས་ལ་བཟོད་པ་མྱུར་དུ་ཐོབ་པར་འགྱུར་ལགས།
en: “Blessed One, what qualities should a bodhisattva great being possess in order to swiftly achieve acceptance that phenomena are unborn?”

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་བཞི་དང་ལྡན་ན་མི་སྐྱེ་བའི་ཆོས་རྣམས་ལ་བཟོད་པ་མྱུར་དུ་ཐོབ་པར་འགྱུར་ཏེ
en: “Son of noble family, there are four qualities that a bodhisattva great being should possess to achieve acceptance that phenomena are unborn.

source: ལུས་ལ་གཟུགས་བརྙན་དང་འདྲ་བར་མོས་པ་དང་།
en: To have the conviction that the body is like a reflection;

source: ངག་ལ་བྲག་ཅ་དང་འདྲ་བར་མོས་པ་དང་།
en: to have the conviction that the voice is like an echo;

source: སེམས་ལ་སྒྱུ་མ་དང་འདྲ་བར་མོས་པ་དང་།
en: to have the conviction that the mind is like an illusion; and

source: ཆོས་ཐམས་ཅད་ལ་མི་ཟད་པའི་ཆོས་ཉིད་དུ་མོས་པ་སྟེ།
en: to have the conviction that all phenomena are the inexhaustible true nature.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་བཞི་པོ་དེ་དག་དང་ལྡན་ན་མི་སྐྱེ་བའི་ཆོས་རྣམས་ལ་བཟོད་པ་མྱུར་དུ་ཐོབ་པར་འགྱུར་རོ། །
en: Son of noble family, a bodhisattva great being who possesses these four qualities will swiftly achieve acceptance that phenomena are unborn.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་བཞི་དང་ལྡན་ན་མི་སྐྱེ་བའི་ཆོས་རྣམས་ལ་བཟོད་པ་མྱུར་དུ་ཐོབ་པར་འགྱུར་ཏེ།
en: “Moreover, son of noble family, there are four other qualities that a bodhisattva great being should possess to achieve acceptance that phenomena are unborn.

source: སེམས་ཅན་ཐམས་ཅད་ལ་བྱམས་པས་ཁྱབ་པར་ཡང་བྱེད་ལ་སེམས་ཅན་དུ་འདུ་ཤེས་པ་ཡང་མེད་པ་དང་།
en: To extend love to all beings, while at the same time not having the idea of ‘beings’;

source: ཆོས་ཐམས་ཅད་ལ་སྟོང་པ་དང་། མི་རྟག་པར་ཡང་མོས་པར་བྱེད་ལ་གཞིར་ཡང་མི་བྱེད་པ་དང་།
en: to have the conviction that all phenomena are empty and impermanent, while not making them into a ‘ground’;

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱང་མཐོང་ལ་ཤའི་མིག་ལ་ཡང་མངོན་པར་ཞེན་པ་མེད་པ་དང་།
en: to perceive all buddhas, while having no fixation with regard to the physical eye;

source: སེམས་རབ་ཏུ་རྣམ་པར་འབྱེད་པ་ལ་ཡང་མཁས་ལ་སེམས་ཀྱང་སེམས་ལ་གཏོད་པར་མི་བྱེད་པ་སྟེ།
en: and to be skilled in discerning the mind, while not focusing on the mind as being a ‘mind.’

source: ལྟ་བ་སྤངས་པའི་ཕྱིར་བདོག་པ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བ་དང་།
en: To give up everything as a way to renounce views;

source: ཉོན་མོངས་པ་ཐམས་ཅད་རབ་ཏུ་ཞི་བའི་ཕྱིར་ཚུལ་ཁྲིམས་ཡོངས་སུ་དག་པ་དང་།
en: to have pure discipline as a means to quell all the afflictions;

source: ཆོས་ཀྱིས་ལྷག་པའི་ཕྱིར་བཟོད་པའི་སྟོབས་དང་ལྡན་པ་དང་།
en: to engender the strength of patience in order to progress in the Dharma; and

source: དབེན་པའི་ཆོས་ཀྱིས་རྣམ་པར་གྲོལ་བའི་ཕྱིར་བརྩོན་འགྲུས་བརྩམས་པ་སྟེ།
en: to foster diligence in order to gain liberation by virtue of solitude.

source: བསམ་གཏན་ཡང་ཐོབ་ལ་བསམ་གཏན་ལ་ཡང་མི་རྟེན་པ་དང་།
en: To achieve concentration but not depend on concentration;

source: ཤེས་རབ་ཀྱིས་ཀྱང་རྣམ་པར་བརྟགས་ལ་སྤྲོས་པ་ཡང་མེད་པ་དང་།
en: to analyze with insight yet be without concepts;

source: ཐབས་ལ་མཁས་པ་ཡང་རབ་ཏུ་འཛིན་ལ་སེམས་ཅན་ཡང་སྡུད་པ་དང་།
en: to acquire skill in methods while magnetizing beings;

source: སྤྱོད་པ་ཐམས་ཅད་ལ་ཡང་གེགས་མེད་ལ་སྤྱོད་པ་ཡང་ཁོང་དུ་ཆུད་པར་བྱེད་པ་སྟེ།
en: and to be unhindered in all actions while gaining realization.

source: བྱམས་པ་ཆེན་པོས་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྐྱོབ་པ་དང་།
en: Through great love, to protect beings;

source: སྙིང་རྗེ་ཆེན་པོས་འཁོར་བ་ལས་ཡོངས་སུ་མི་སྐྱོ་བ་དང་།
en: through great compassion, not to become weary with cyclic existence;

source: དགའ་བ་ཆེན་པོས་ཆོས་ལ་དགའ་ཞིང་མཆོག་ཏུ་དགའ་བ་དང་།
en: through great joy, to take joy and great delight in the Dharma; and

source: བཏང་སྙོམས་ཆེན་པོས་རྗེས་སུ་ཆགས་པ་དང་ཁོང་ཁྲོ་བ་སྤོང་བ་སྟེ།
en: through great equanimity, to give up attachment and anger.

source: རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་མངོན་སུམ་དུ་བྱེད་པ་དང་།
en: To realize directly the three gates of liberation;

source: དུས་གསུམ་ཡོངས་སུ་ཤེས་པ་དང་།
en: to comprehend the three times;

source: ཁམས་གསུམ་ལས་ཡང་དག་པར་འདའ་བ་དང་།
en: to transcend the three realms; and

source: ཆོས་ཐམས་ཅད་རང་བཞིན་གྱིས་མ་སྐྱེས་པ་ལ་ཡིད་ཆེས་པ་སྟེ།
en: to have trust in the fact that all phenomena are inherently without birth.

source: བཞི་པ་བསྒྲུབ་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཤད་པ་ན་ཚན་པོ་ཆེ་ཆེན་པོ་དྲི་མ་མེད་པའི་གཟི་བརྗིད་ཀྱིས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་སྟེ།
en: At that explanation of these fourfold enumerations of qualities for accomplishment, the mighty strongman Vimalatejā achieved acceptance that phenomena are unborn.

source: དེ་དགའ་བ་དང་མཆོག་ཏུ་དགའ་བ་ཐོབ་པ་དེ་ཁོ་ནས་ཏ་ལ་བདུན་སྲིད་ཙམ་གྱི་ནམ་མཁའ་ལ་མངོན་པར་འཕགས་སོ། །
en: He felt joy and elation, and simply through that he ascended into the air to the height of seven palm trees.

source: ལྷ་དང་མིའི་སིལ་སྙན་འབུམ་ཡང་འཁྲོལ་ལོ། །
en: Hundreds of thousands of human and divine instruments sounded.

source: པད་མའི་སྤྲིན་གྱི་ཆར་ཆེན་པོ་ཡང་མངོན་པར་བབ་བོ། །འཇིག་རྟེན་འདི་ཡང་སྣང་བ་ཆེན་པོས་ཁྱབ་པར་གྱུར་ཏོ། །
en: A rain of lotus flowers fell, and the whole world was filled with an immense glow.

source: དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་འཛུམ་པ་མཛད་དེ།
en: The Blessed One then smiled.

source: འདི་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་ཆོས་ཉིད་དེ། གང་གི་ཚེ་འཛུམ་པ་མཛད་པ་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱི་ཞལ་གྱི་སྒོ་ནས་འོད་ཟེར་སྣ་ཚོགས་འདི་ལྟ་སྟེ། སྔོན་པོ་དང་། སེར་པོ་དང་། དམར་པོ་དང་། དཀར་པོ་དང་། བཙོད་ཀ་དང་། ཤེལ་དང་། དངུལ་གྱི་ཁ་དོག་ལྟ་བུ་དག་བྱུང་ངོ་། །
en: As is an attribute of the thus-gone ones, when he smiled an assortment of blue, yellow, red, white, crimson, crystal, and silver-colored light rays emanated from his mouth.

source: དེ་དག་བྱུང་ནས་འཇིག་རྟེན་གྱི་ཁམས་མཐའ་ཡས་མུ་མེད་པ་འོད་ཀྱིས་ཁྱབ་པར་གྱུར་ནས་ཉི་མ་དང་ཟླ་བ་རྣམས་ཀྱི་འོད་ཀྱང་ཟིལ་གྱིས་མནན་ཏེ་ཚངས་པའི་འཇིག་རྟེན་དུ་ཐུག་ནས་ཕྱིར་ལོག་སྟེ་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱི་གཙུག་ཏུ་ནུབ་པར་གྱུར་ཏོ། །
en: These lights filled the universe with an infinite, limitless radiance that eclipsed that of the sun and moon and reached even the Brahmā realm, before returning to dissolve into the crown of the Blessed One’s head.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་སྟན་ལས་ལངས་ཏེ། བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ།
en: At that moment, venerable Ānanda rose from his seat, draped his shawl over one shoulder, and knelt on his right knee.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: With his palms together, he bowed toward the Blessed One and asked him,

source: བཅོམ་ལྡན་འདས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་རྒྱུ་མ་མཆིས་རྐྱེན་མ་མཆིས་པར་འཛུམ་པ་མི་མཛད་ན། འཛུམ་པ་མཛད་པའི་རྒྱུ་ནི་གང་ལགས། རྐྱེན་ནི་གང་ལགས།
en: “Blessed One, since the blessed buddhas do not smile in the absence of causes and conditions, what are the causes for this smile, and what are the conditions?”

source: དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་ཀྱང་སྨྲས་སོ། །
en: He also expressed this in verse:

source: ཡེ་ཤེས་མཆོག་བརྙེས་ཡོངས་དག་ཡངས་པའི་སྤྱན་མངའ་བ། །དབང་པོ་ཞི་བ་ཞི་གནས་ཕ་རོལ་ཕྱིན་མཆོག་བརྙེས། །
en: “You who have attained supreme wisdom and have vast, pure vision, With senses calm, you have achieved sublime, transcendent tranquility;

source: སྐུ་མདོག་གསེར་གྱི་རི་བོ་ལྷ་ཡི་འོད་འདྲ་བ། །
en: Your body shines with divine light, radiant like a golden mountain.

source: ཅི་ཡི་སླད་དུ་བཅོམ་ལྡན་འཛུམ་པ་འདི་སྟོན་མཛད། །
en: Why is it you displayed this smile, O Blessed One?

source: གང་གི་བློ་གྲོས་ཅི་འདྲ་དུས་གསུམ་ལྡན་པ་དང་། །ལྷ་དང་མི་རྣམས་སེམས་ཀྱི་སྤྱོད་པ་མཁྱེན་བཞིན་དུ། །
en: “While your intelligence understands the three times as they are, As well as the mental doings of gods and men,

source: འདུ་ཤེས་མི་མངའ་རྟག་ཏུ་ཡེ་ཤེས་མཆོག་བརྙེས་པ། །ཞལ་རས་ཟླ་འདྲ་འཛུམ་པའི་དོན་ནི་བསྟན་པར་གསོལ། །
en: You are perpetually free of ideas, in attainment of supreme wisdom— Please explain the meaning of your moon-like face’s smile.

source: འདས་པའི་སངས་རྒྱས་ཇི་སྙེད་གང་དག་མ་འོངས་དུས། །གང་དག་གནས་པའི་རྒྱལ་བ་དེ་དག་མཚུངས་པ་སྟེ། །
en: “As many buddhas as have come in the past, or will in the future, As well as those dwelling now—you are their equal.

source: སེམས་ཅན་གང་དག་དཀར་པོ་སྤྱོད་པ་སྣ་ཚོགས་པ། །སྦྱོར་མཁྱེན་ལུང་བསྟན་སླད་དུ་ཐམས་ཅད་ཡང་དག་གསུངས། །
en: You who know how beings engage in various good deeds, Please divulge everything, by way of a prophecy.

source: སངས་རྒྱས་ཞིང་འདི་དག་ནི་སྐུ་ཡིས་ཐམས་ཅད་ཁྱབ། །
en: “Your body pervades this entire buddhafield,

source: ཁྱོད་ཀྱི་གསུང་ནི་སངས་རྒྱས་ཞིང་མང་ཡངས་པར་གྲག །
en: Your speech resounds widely through numerous buddhafields,

source: འདིར་ནི་ཐུགས་ཀྱིས་འགྲོ་བ་ཀུན་ལ་བྱམས་པ་བསྐྱེད། །
en: Your mind has love for all beings within them.

source: རྒྱལ་བ་ཡེ་ཤེས་མཐའ་ཡས་ལྡན་པ་གང་སླད་གསུངས། །
en: Victorious One, your wisdom is infinite—please explain why.

source: ཆོས་རྣམས་ཡ་མ་བརླ་སྟེ་ཆུ་ཟླ་འདྲ་བ་དང་། །སྒྱུ་མ་ལྟ་བུར་འཇིག་པ་རྨི་ལམ་ངོ་བོ་ཉིད། །སྤྲིན་ལྟར་མི་བརྟན་འཇིག་པའི་ཆོས་ཅན་མཁྱེན་པ་པོ། །
en: “You have understood that things are void, like a moon in water, Fleeting as an illusion, fundamentally a dream, Ephemeral as clouds, and transient by nature.

source: མི་ཡི་སེང་གེ་གང་སླད་འཛུམ་དོན་བསྟན་པར་གསོལ། །
en: Lion among Men, please divulge the reason for your smile.

source: སྟོང་པ་མཚན་མེད་སྨོན་མེད་རྟོགས་པས་རྣམ་པར་གྲོལ། །རྟག་ཏུ་ཐུགས་དུལ་ཆོས་ཀྱི་ངོ་བོ་ཉིད་ལ་མཁས། །
en: “Realizing emptiness, signlessness, and wishlessness, you are free, Your mind always gentle, expert in the very nature of phenomena;

source: རླུང་སྲུབས་མཁའ་ལ་འཚུབ་ཀྱང་སྤྲོས་མེད་འདྲ་བ་པོ། །
en: While a tempest rages in the sky, you seem free of elaboration.

source: ཅི་སླད་འཛུམ་མཛད་འདི་ལ་དོན་ནི་ཅི་མཆིས་གསུངས། །
en: Why did you smile? Pray tell, what was the reason?

source: གང་གི་སེམས་དེང་སངས་རྒྱས་ཡེ་ཤེས་མཆོག་ལ་བཏུད། །
en: “I bow today before the one whose mind is the supreme wisdom of awakening;

source: གང་གིས་དེ་རིང་ཤིང་རྒྱལ་དྲུང་དུ་བདུད་ཀྱང་བཅོམ། །
en: Today you have conquered the demons at the foot of the king of trees.

source: གང་གིས་རྒྱལ་བ་མཆོག་རྣམས་གདན་ནི་ཡོངས་སུ་བཟུང་། །
en: You who have ascended the throne of the sublime victorious ones,

source: སྐྱེས་བུ་ཁྱུ་མཆོག་གིས་ནི་ཅི་ཕྱིར་འཛུམ་པ་བསྟན། །
en: Supreme Leader of men, please say why it was you smiled.

source: འདི་ན་རྒྱལ་བའི་ཉན་ཐོས་དེ་རྣམས་ས་མ་མཆིས། །
en: “This is not a place of the Victorious One’s śrāvakas,

source: འདི་ལ་རང་སངས་རྒྱས་ཀྱི་ཡུལ་ཡང་ཅི་མ་མཆིས། །
en: Nor is it the domain of the solitary buddhas;

source: འདི་ནི་སངས་རྒྱས་ཡོན་ཏན་རྒྱ་མཚོ་རྣམས་ཀྱི་ཡུལ། །
en: This is the domain of the ocean-like qualities of buddhahood.

source: འཇིག་རྟེན་མཆོག་གིས་འཛུམ་པའི་རྒྱུ་ནི་བསྟན་པར་གསོལ། །
en: Please explain the reason why the Chief of the World has smiled.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The Blessed One then answered Venerable Ānanda,

source: ཀུན་དགའ་བོ་ཁྱོད་ཀྱིས་ཚན་པོ་ཆེ་ཆེན་པོ་དྲི་མ་མེད་པའི་གཟི་བརྗིད་ཏ་ལ་བདུན་སྲིད་ཙམ་གྱི་སྟེང་གི་བར་སྣང་ལ་མངོན་པར་འཕགས་ཏེ་འདུག་པ་མཐོང་ངམ།
en: “Ānanda, did you see the way the mighty strongman Vimalatejā ascended into midair to the height of seven palm trees?”

source: བདེ་བར་གཤེགས་པ་མཐོང་ལགས་སོ། །
en: I saw it indeed, Blissful One.”

source: ཀུན་དགའ་བོ་ཚན་པོ་ཆེ་ཆེན་པོ་དྲི་མ་མེད་པའི་གཟི་བརྗིད་འདི་བསྐལ་པ་གྲངས་མེད་པ་གསུམ་པ་ཕྲག་འབུམ་གྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཏེ
en: “Ānanda, over the course of a hundred thousand cycles of three incalculable eons, the mighty strongman Vimalatejā will fully awaken to unsurpassed and completely perfect buddhahood.

source: ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་རྣམ་པར་དག་པར་བྱེད་པ་ཞེས་བྱ་བར་བསྐལ་པ་ཚངས་པས་བསྟོད་པ་ཞེས་བྱ་བ་དེ་ལ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ་ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་བཀོད་པ་མང་པོའི་རྒྱལ་པོ་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་འབྱུང་ངོ་། །
en: In the eastern realm known as Utterly Purifying, in the eon known as Praised by Brahmā , he will appear in the world as a thus-gone one, a foe-destroyer, a completely perfect buddha. He will be someone who is knowledgeable and virtuous, a blissful one, someone who knows the world, a charioteer to guide beings, an unsurpassed being, a teacher of gods and men, a blessed buddha known as King of Many Arrangements.

source: ཀུན་དགའ་བོ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བཀོད་པ་མང་པོའི་རྒྱལ་པོའི་སངས་རྒྱས་ཀྱི་ཞིང་རྣམ་པར་དག་པར་བྱེད་པའི་འཇིག་རྟེན་གྱི་ཁམས་དེ་ཡང་འབྱོར་པ་དང་། རྒྱས་པ་དང་བདེ་བ་དང་ལོ་ལེགས་པ་དང་། ཉམས་དགའ་བ་དང་། སྐྱེ་བོ་དང་། མི་མང་པོས་གང་བར་འགྱུར་ཏེ
en: Ānanda, that buddha realm known as Utterly Purifying of the Thus-Gone One, the foe-destroyer, the completely perfect Buddha King of Many Arrangements will be filled with prosperity, abundance, happiness, plentiful harvests, and gaiety, and will have many human and other inhabitants.

source: ཀུན་དགའ་བོ་དཔེར་ན་དགའ་ལྡན་གྱི་ལྷ་རྣམས་ཀྱི་ལོངས་སྤྱོད་དང་། ཡོངས་སུ་སྤྱད་པ་ཇི་ལྟ་བ་བཞིན་དུ་སངས་རྒྱས་ཀྱི་ཞིང་རྣམ་པར་དག་པར་བྱེད་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སེམས་ཅན་དེ་དག་གི་ལོངས་སྤྱོད་དང་། ལོངས་སུ་སྤྱད་པ་ཡང་དེ་འདྲ་བར་འགྱུར་རོ། །
en: As an analogy, Ānanda, the riches and enjoyments of beings in the realm of the Utterly Purifying buddhafield will be on a par with those of the gods in the Joyous Heaven.

source: དེ་བཞིན་གཤེགས་པ་བཀོད་པ་མང་པོའི་རྒྱལ་པོ་དེ་ཡང་གཏམ་གཞན་མི་གསུང་བར་བྱང་ཆུབ་སེམས་དཔའ་བསྡུ་བའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་འབའ་ཞིག་སྟོན་ཏོ། །
en: “In order to gather bodhisattvas, the Thus-Gone One King of Many Arrangements will teach only the bodhisattva collection without expounding anything else.

source: དེ་ན་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་རྣམས་ཀྱི་མིང་ཡང་མེད་དེ།
en: The words śrāvaka and solitary buddha will not even exist there.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བཟོད་པ་ཐོབ་པའི་བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་ཆེན་པོ་འབའ་ཞིག་འབྱུང་བར་འགྱུར་རོ། །
en: The only community that will emerge will be the great bodhisattva saṅgha that consists of bodhisattva great beings who have achieved acceptance.

source: དེ་བཞིན་གཤེགས་པ་དེ་ཡང་ཚེ་དཔག་ཏུ་མེད་པར་འགྱུར་རོ། །
en: That Thus-Gone One will live for a fathomless span of time.

source: དེའི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་མི་ཁོམ་པ་བརྒྱད་མེད་དེ།
en: In his buddhafield, the eight unfree states will not exist.

source: དེ་བདུད་དང་ཕྱིར་རྒོལ་བ་བཅོམ་པ་དང་།
en: Demons and hostile forces will be vanquished.

source: གཞན་མུ་སྟེགས་ཅན་མེད་པ་དང་།
en: There will be no extremists.

source: བཻ་དཱུརྱ་ལས་གྲུབ་ལ་འཛམ་བུའི་ཆུ་བོའི་གསེར་གྱི་པད་མས་སྤྲས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་འགྱུར་རོ། །
en: The buddhafield will be made of beryl and be adorned with lotus flowers of gold from the Jāmbū River.”

source: དེ་ནས་ཚན་པོ་ཆེ་ཆེན་པོ་དྲི་མ་མེད་པའི་གཟི་བརྗིད་བར་སྣང་དེ་ལས་བབས་ཏེ།
en: Eventually the mighty strongman Vimalatejā descended from midair.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་ཕྱག་འཚལ་ནས། བཅོམ་ལྡན་འདས་ལ་རབ་ཏུ་འབྱུང་བར་གསོལ་ཏེ།
en: He bowed at the feet of the Blessed One, requested ordination from the Blessed One, and

source: དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ངོ་། །
en: was ordained in the teachings of the Thus-Gone One.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྲེད་མེད་ཀྱི་བུས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: The bodhisattva great being Nārāyaṇa now said to the Blessed One,

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཆོས་འདུལ་བ་ལེགས་པར་གསུངས་པ་ནི་བཅོམ་ལྡན་འདས་ངོ་མཚར་ལགས་སོ། །
en: “The way that the Blessed One has expounded on the doctrine of discipline, Blessed One, is indeed marvelous.

source: བདེ་བར་གཤེགས་པ་ངོ་མཚར་ལགས་ཏེ།
en: Blissful One, it is indeed marvelous.

source: འདི་ལྟར་དེ་བཞིན་གཤེགས་པ་ལ་སྐུར་པ་འདེབས་པའམ། ཀླན་ཀ་ཚོལ་བའམ། ཐོ་འཚམས་པའམ། བསྟིང་པའི་སླད་དུ་མཆིས་པ་གང་དག་ལྷགས་པ་དེ་དག་ཀྱང་དེ་བཞིན་གཤེགས་པ་མཐོང་མ་ཐག་ཏུ་དགའ་བ་དང་། དང་བ་དང་། མཆོག་ཏུ་དགའ་བ་དྲག་པོ་འཐོབ་པར་འགྱུར་ལ།
en: Even those who visit the Thus-Gone One to denigrate him, pick out his faults, make trouble, or ridicule him feel deeply pleased, delighted, and overjoyed as soon as they see the Thus-Gone One.

source: ང་རྒྱལ་དང་། རྒྱགས་པ་དང་། དྲེགས་པ་ངེས་པར་བཅོམ་ནས་
en: Their pride, conceit, and arrogance are utterly subdued.

source: དེ་བཞིན་གཤེགས་པ་ཉག་གཅིག་ལ་འདུད་ཅིང་། བཅོམ་ལྡན་འདས་ཉག་གཅིག་ལ་ཐལ་མོ་སྦྱར་བ་བཏུད་པ་དང་།
en: They bow solely to the Thus-Gone One, and prostrate themselves solely to the Thus-Gone One with their palms joined.

source: བཅོམ་ལྡན་འདས་འདི་ལྟར་ཚན་པོ་ཆེ་ཆེན་པོ་དྲི་མ་མེད་པའི་གཟི་བརྗིད་འདི་ང་རྒྱལ་དང་། རྒྱགས་པ་དང་། དྲེགས་པ་དྲག་པོས་མཆིས་ལ།
en: Blessed One, that was how the mighty strongman Vimalatejā arrived, with immense pride, conceit, and arrogance. Yet

source: ཆོས་འདི་ལྟ་བུ་འདི་ཐོས་ནས་
en: he has heard the teaching in this way and

source: བདག་ཉིད་ཆེན་པོ་འདི་ལྟ་བུ་ཐོབ་སྟེ
en: has achieved the state of a great being.

source: སེམས་ཅན་དཔག་ཏུ་མ་མཆིས་གྲངས་མ་མཆིས་པའི་ང་རྒྱལ་དང་། རྒྱགས་པ་དང་། དྲེགས་པ་སྤང་བའི་སླད་དུ་ཆོས་སྟོན་པར་འགྱུར་ལགས་སོ། །
en: He will teach the Dharma to eradicate the pride, conceit, and arrogance of an unfathomable, countless number of beings.

source: བཅོམ་ལྡན་འདས་སྔོན་འདས་པའི་དུས་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཇི་སྙེད་ཅིག་ལ་ཚན་པོ་ཆེ་ཆེན་པོ་དྲི་མ་མེད་པའི་གཟི་བརྗིད་ཀྱིས་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་འཚལ་བའི་སླད་དུ་དགེ་བའི་རྩ་བ་བསྐྱེད་ནས་དེས་ན་ད་ལྟར་འདི་ལྟ་བུའི་མངོན་པར་ཤེས་པ་མྱུར་བ་ཐོབ་པར་གྱུར་ལགས།
en: Blessed One, toward how many thus-gone ones, foe-destroyers, completely perfect buddhas in the past did the mighty strongman Vimalatejā engender the roots of virtue in pursuit of completely perfect awakening, such that now he has attained the superknowledges so swiftly?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྲེད་མེད་ཀྱི་བུ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The Blessed One said to the bodhisattva great being Nārāyaṇa,

source: སྲེད་མེད་ཀྱི་བུ་ཚན་པོ་ཆེ་ཆེན་པོ་དྲི་མ་མེད་པའི་གཟི་བརྗིད་ཀྱིས་ནི་འདས་པའི་དུས་ན་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་འདོད་པའི་ཕྱིར་སངས་རྒྱས་བྱེ་བ་ཕྲག་དྲུག་ཅུ་རྩ་གཉིས་ལ་དགེ་བའི་རྩ་བ་བསྐྱེད་དོ། །
en: “Nārāyaṇa, in the past, the mighty strongman Vimalatejā, longing for unsurpassed and completely perfect awakening, engendered the roots of virtue toward six billion, two hundred million buddhas.

source: དེ་ཕྱིན་ཆད་ཀྱང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དཔག་ཏུ་མེད། གྲངས་མེད་པ་ལ་བཀུར་སྟིར་བྱེད།
en: Subsequent to that, he served an unfathomable, countless number of blessed buddhas;

source: བླ་མར་བྱེད། རི་མོ་བྱེད། མཆོད་པ་བྱེད་པར་འགྱུར་ཏེ། ཚངས་པར་སྤྱད་པ་སྤྱོད་པར་འགྱུར་རོ། །
en: he took them as his teachers, venerated and worshiped them, and in doing so practiced chastity.”

source: སྲེད་མེད་ཀྱི་བུས་གསོལ་པ།
en: Nārāyaṇa then asked,

source: བཅོམ་ལྡན་འདས་མི་དགེ་བའི་རྩ་བ་གང་གིས་ན་དེའི་བྱང་ཆུབ་ཀྱི་སེམས་མ་མཆིས་པར་གྱུར་ནས།
en: “Blessed One, what roots of nonvirtue led him to be lacking in the mind of awakening,

source: དེས་ན་འདི་བརྩད་པའི་བསམ་པས་དེ་བཞིན་གཤེགས་པའི་སྤྱན་སྔར་མཆིས་ལ་འདི་ལྟ་བུའི་ང་རྒྱལ་དང་། རྒྱགས་པ་དང་། དྲེགས་པ་དང་ལྡན་པར་གྱུར་ལགས།
en: such that he arrived before the Thus-Gone One with the intention to quarrel, full of pride, conceit, and arrogance?”

source: སྲེད་མེད་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་བྱང་ཆུབ་ཀྱི་སེམས་བརྗེད་པར་འགྱུར་ཏེ།
en: “Nārāyaṇa, there are four traits with which a bodhisattva will neglect the mind of awakening.

source: ལྷག་པའི་ང་རྒྱལ་དང་། ཆོས་ལ་མ་གུས་པ་དང་། དགེ་བའི་བཤེས་གཉེན་ལ་ཁྱད་དུ་གསོད་པ་དང་། ལོག་པའི་ཚིག་སྨྲ་བ་སྟེ།
en: Immense pride, disrespect for the Dharma, deprecating the spiritual guide, and speaking falsehoods.

source: སྲེད་མེད་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་ཀྱི་སེམས་བརྗེད་པར་འགྱུར་རོ། །
en: Nārāyaṇa, a bodhisattva who has these four traits will neglect the mind of awakening.

source: སྲེད་མེད་ཀྱི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་བྱང་ཆུབ་ཀྱི་སེམས་བརྗེད་པར་འགྱུར་ཏེ།
en: “Moreover, Nārāyaṇa, there are four more traits with which a bodhisattva will also neglect the mind of awakening.

source: ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་པའི་རྣལ་འབྱོར་སྤྱོད་པ་དག་དང་འདྲིས་པར་བྱེད་པ་དང་།
en: To associate with the practitioners of the Vehicle of Solitary Buddhas;

source: ཐེག་པ་དམན་པ་ལ་མོས་པ་རྣམས་དང་།
en: to have inclinations toward the Lesser Vehicle;

source: བྱང་ཆུབ་སེམས་དཔའ་ལ་སྡང་ཞིང་སྐུར་པ་འདེབས་པ་དང་།
en: to denigrate and be hostile toward bodhisattvas;

source: ཆོས་རྣམས་ལ་སློབ་དཔོན་དཔེ་མཁྱུད་བྱེད་པ་སྟེ།
en: and to be a tight-fisted instructor with respect to giving teachings.

source: སྒྱུ་བྱེད་པ་དང་། སེམས་ཅན་རྣམས་ལ་གཡོས་སྟེན་པར་བྱེད་པ་དང་། དགེ་བའི་བཤེས་གཉེན་རྣམས་ལ་ལྕེ་གཉིས་བྱེད་པ་དང་། རྙེད་པ་དང་། བཀུར་སྟི་ལ་ལྷག་པར་ཞེན་པ་སྟེ།
en: To be pretentious; to have deceit in the way one serves beings; to be two-tongued toward spiritual guides; and to be overly fixated on gain and respect.

source: བདུད་ཀྱི་ལས་མ་རྟོགས་པ་དང་།
en: Not to recognize the workings of demons;

source: ལས་ཀྱི་སྒྲིབ་པས་བསྒྲིབས་པ་དང་། ལྷ
en: to be obscured by the veil of karma;

source: ག་པའི་བསམ་པ་སྟོབས་ཆུང་བ་དང་།
en: to be weak in altruism; and

source: ཤེས་རབ་དང་ཐབས་མེད་པ་སྟེ།
en: to lack insight and method.

source: སྲེད་མེད་ཀྱི་བུ་ཡང་གང་གི་ཕྱིར་ཚན་པོ་ཆེ་ཆེན་པོ་དྲི་མ་མེད་པའི་གཟི་བརྗིད་ཀྱི་བྱང་ཆུབ་ཀྱི་སེམས་བརྗེད་པར་གྱུར་པ་དེ་ཉོན་ཅིག །
en: “Nārāyaṇa, why was it that the mighty strongman Vimalatejā neglected the mind of awakening? Let me tell you.

source: སྲེད་མེད་ཀྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་བསྐལ་པ་བཟང་པོ་འདི་ཉིད་ལ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་འཁོར་བ་འཇིག་ཅེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ
en: Once, in the distant past of this Excellent Eon, there appeared in the world a thus-gone one, a foe-destroyer, a completely perfect buddha, one who was knowledgeable and virtuous, a blissful one, one who knew the world, a charioteer to guide beings, an unsurpassed being, a teacher of gods and men, a blessed buddha known as Krakucchanda.

source: དེའི་བསྟན་པ་གནས་པ་ན་བྲམ་ཟེ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུ་ནོར་བཟངས་ཞེས་བྱ་བ་ཞིག་བྱུང་སྟེ་
en: During the period of his teachings, there was a priest named Wealthy as the Great Sal Tree.
